// Задание 1
//
// 1. На языке С++, написать минимум по 2 класса реализовывающих циклический буфер.
// 
// 2. Объяснить плюсы и минусы каждой реализации.

// Решение
//
// 1.  
//    .
//    Плюсы: Использует простые арифметические операции, выполнится за О(1).
//    Минусы: Использует больше операций, чем предыдущая функция.
//
// 2. 
//    .
//    Плюсы: Всё ещё работает, хотя за О(n).
//    Минусы: Код значительно усложнился и работает дольше.

int main(){
    void ringBuffeTest();
    return 0;
}

void ringBuffeTest(){

    

}
